# SQL for Explorary Data Analysis

## Basic Set-up

In [56]:
%reload_ext sql

In [57]:
# import neccesary libraries
import sqlite3
import pandas as pd
import sqlalchemy

In [58]:
# load the data file
df = pd.read_csv('gsearch_jobs copy.csv')

In [59]:
#create and connect the database in the folder
conn = sqlite3.connect('job.db')

In [60]:
#import the data frame to the database
df.to_sql("jobs_info", conn, if_exists='replace', index=False, method="multi", chunksize=1000)

24284

In [61]:
#checking
%sql sqlite:///job.db

In [62]:
#Finding how many rows of job data available for the selected columns
%sql select count(company_name), count(title),count(salary_standardized), count(description_tokens)  from jobs_info

 * sqlite:///job.db
Done.

[(24284, 24284, 4601, 24284)]

In [63]:
# delete the rows that do not have salary_rate, salary_avg, salary_min, salary_max, salary_standardized
%sql DELETE FROM jobs_info WHERE salary_rate IS NULL OR salary_avg IS NULL OR salary_min IS NULL OR salary_max IS NULL OR salary_standardized IS NULL

 * sqlite:///job.db
19964 rows affected.

[]

In [46]:
%sql select count(*) from jobs_info

 * sqlite:///job.db
Done.

[(4320,)]

In [52]:
df_cleaned = %sql SELECT * FROM jobs_info
df_cleaned = df_cleaned.DataFrame()

 * sqlite:///job.db
Done.

In [53]:
df_cleaned.head

<bound method NDFrame.head of       index                                              title  \
0         6  Experienced Data Analyst Required: Dynamic Dat...
1        13                                Master Data Analyst
2        23                                Master Data Analyst
3        33                                Master Data Analyst
4        43                                       Data Analyst
...     ...                                                ...
4315     14                     Marketing Data & BI Analyst II
4316     15                                  Lead-Data Analyst
4317     16                                  Lead-Data Analyst
4318     17                                  Lead-Data Analyst
4319     18  Institutional Credit Management - Lending Data...

                    company_name            location                    via  \
0                         Upwork           Anywhere              via Upwork
1     Charles River Laboratories    United States                via Indeed
2     Charles River Laboratories    United States                via Indeed
3     Charles River Laboratories    United States                via Indeed
4                 Insight Global           Anywhere            via LinkedIn
...                          ...                 ...                    ...
4315                EDWARD JONES       Houstonia, MO  via My ArkLaMiss Jobs
4316                EDWARD JONES      Marshfield, MO  via My ArkLaMiss Jobs
4317                EDWARD JONES      High Point, MO  via My ArkLaMiss Jobs
4318                EDWARD JONES         Calhoun, MO  via My ArkLaMiss Jobs
4319                        Citi       United States  via My ArkLaMiss Jobs

                                             extensions  \
0     ['10 hours ago', '37‚Äì75 an hour', 'Work from...
1     ['24 hours ago', '65K‚Äì75K a year', 'Full-time']
2     ['24 hours ago', '65K‚Äì75K a year', 'Full-time']
3     ['24 hours ago', '65K‚Äì75K a year', 'Full-time']
4     ['15 hours ago', '40‚Äì45 an hour', 'Work from...
...                                                 ...
4315  ['23 hours ago', '76,798‚Äì130,764 a year', 'F...
4316  ['23 hours ago', '106,916‚Äì182,047 a year', '...
4317  ['23 hours ago', '106,916‚Äì182,047 a year', '...
4318  ['23 hours ago', '106,916‚Äì182,047 a year', '...
4319  ['24 hours ago', '105,850‚Äì158,780 a year', '...

                                                 job_id  \
0     eyJqb2JfdGl0bGUiOiJFeHBlcmllbmNlZCBEYXRhIEFuYW...
1     eyJqb2JfdGl0bGUiOiJNYXN0ZXIgRGF0YSBBbmFseXN0Ii...
2     eyJqb2JfdGl0bGUiOiJNYXN0ZXIgRGF0YSBBbmFseXN0Ii...
3     eyJqb2JfdGl0bGUiOiJNYXN0ZXIgRGF0YSBBbmFseXN0Ii...
4     eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...
...                                                 ...
4315  eyJqb2JfdGl0bGUiOiJNYXJrZXRpbmcgRGF0YSBcdTAwMj...
4316  eyJqb2JfdGl0bGUiOiJMZWFkLURhdGEgQW5hbHlzdCIsIm...
4317  eyJqb2JfdGl0bGUiOiJMZWFkLURhdGEgQW5hbHlzdCIsIm...
4318  eyJqb2JfdGl0bGUiOiJMZWFkLURhdGEgQW5hbHlzdCIsIm...
4319  eyJqb2JfdGl0bGUiOiJJbnN0aXR1dGlvbmFsIENyZWRpdC...

                                              thumbnail     posted_at  \
0                                                  None  10 hours ago
1     https://encrypted-tbn0.gstatic.com/images?q=tb...  24 hours ago
2     https://encrypted-tbn0.gstatic.com/images?q=tb...  24 hours ago
3     https://encrypted-tbn0.gstatic.com/images?q=tb...  24 hours ago
4     https://encrypted-tbn0.gstatic.com/images?q=tb...  15 hours ago
...                                                 ...           ...
4315                                               None  23 hours ago
4316                                               None  23 hours ago
4317                                               None  23 hours ago
4318                                               None  23 hours ago
4319  https://encrypted-tbn0.gstatic.com/images?q=tb...  24 hours ago

     schedule_type  ...  search_location commute_time salary_rate salary_avg  \
0       Contractor  ...    United States         None     an hour       56.0
1        Full-time  ...    United States         None      a year    70000.0
2        Full-time  ...    United States         None      a year    70000.0
3        Full-time  ...    United States         None      a year    70000.0
4        Full-time  ...    United States         None     an hour       42.5
...            ...  ...              ...          ...         ...        ...
4315     Full-time  ...    United States         None      a year   103781.0
4316     Full-time  ...    United States         None      a year   144481.5
4317     Full-time  ...    United States         None      a year   144481.5
4318     Full-time  ...    United States         None      a year   144481.5
4319     Full-time  ...    United States         None      a year   132315.0

     salary_min salary_max  salary_hourly  salary_yearly  salary_standardized  \
0          37.0       75.0           56.0            NaN             116480.0
1       65000.0    75000.0            NaN        70000.0              70000.0
2       65000.0    75000.0            NaN        70000.0              70000.0
3       65000.0    75000.0            NaN        70000.0              70000.0
4          40.0       45.0           42.5            NaN              88400.0
...         ...        ...            ...            ...                  ...
4315    76798.0   130764.0            NaN       103781.0             103781.0
4316   106916.0   182047.0            NaN       144481.5             144481.5
4317   106916.0   182047.0            NaN       144481.5             144481.5
4318   106916.0   182047.0            NaN       144481.5             144481.5
4319   105850.0   158780.0            NaN       132315.0             132315.0

                                     description_tokens
0                                      ['excel', 'sql']
1                ['sap', 'excel', 'word', 'powerpoint']
2                ['sap', 'excel', 'word', 'powerpoint']
3                ['sap', 'excel', 'word', 'powerpoint']
4                                               ['sql']
...                                                 ...
4315  ['tableau', 'python', 'power_bi', 'excel', 'sq...
4316                                                 []
4317                                                 []
4318                                                 []
4319                              ['tableau', 'cognos']

[4320 rows x 23 columns]>

In [54]:
conn.close()

In [55]:
df_cleaned.to_csv("df_cleaned.csv", index=False)